set_operating_conditions slow -library slow	

set_wire_load_model -name "smic18_wl10"
set_wire_load_mode top

