Initializing gui preferences from file  /home/sasasatori/.synopsys_icc_prefs.tcl
icc_shell> start_gui
Information: Visibility is turned ON for cells and cell contents because the task is set to Block Implementation (GUI-026)
icc_shell> open_mw_lib /home/sasasatori/experiment/icc/my_lib1.mw
{my_lib1.mw}
icc_shell> ::iccGUI::open_mw_cel  cic_filter
icc_shell> open_mw_cel cic_filter
Preparing data for query................... 
Warning: No valid link library found; check the link_library variable. (IFS-008)
Information: Opened "cic_filter.CEL;1" from "/home/sasasatori/experiment/icc/my_lib1.mw" library. (MWUI-068)
{cic_filter}
icc_shell> 
icc_shell> extract_rc
Loading db file '/tools/Synopsys/icc/O-2018.06-SP1/libraries/syn/gtech.db'
Information: linking reference library : /home/sasasatori/experiment/lib/smic18. (PSYN-878)
Error: No valid link library specified, please check library setup. (PSYN-958)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
# GUI Debug: Building dc from empty. -- Time: 18ms
Information: linking reference library : /home/sasasatori/experiment/lib/smic18. (PSYN-878)
Error: No valid link library specified, please check library setup. (PSYN-958)
Error: Could not read the following target libraries:
your_library.db 
 (UIO-3)
# GUI Debug: Building dc from empty. -- Time: 0ms
Error: Fail to rebuild timing design from database (UID-841)
0
icc_shell> set search_path "../lib/logic   ../lib/milkyway"
../lib/logic   ../lib/milkyway
icc_shell> set target_library "slow.db"
slow.db
icc_shell> set link_library "* $target_library"
* slow.db
icc_shell> set symbol_library " smic18.sdb "
 smic18.sdb 
icc_shell> extract_rc
Loading db file '/home/sasasatori/experiment/lib/logic/slow.db'
Information: linking reference library : /home/sasasatori/experiment/lib/smic18. (PSYN-878)
Information: Loading local_link_library attribute {slow.db}. (MWDC-290)

  Linking design 'cic_filter'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (7 designs)               cic_filter.CEL, etc
  slow (library)              /home/sasasatori/experiment/lib/logic/slow.db

# GUI Debug: Building dc from empty. -- Time: 602ms
Information: The design has horizontal rows, and Y-symmetry has been used for sites. (MWDC-217)
Floorplan loading succeeded.

  Loading design 'cic_filter'




Information: Library Manufacturing Grid(GridResolution) : 5
Information: Time Unit from Milkyway design library: 'ns' 
Information: Design Library and main library timing units are matched - 1.000 ns. 
Information: Resistance Unit from Milkyway design library: 'kohm' 
Information: Design Library and main library resistance units are matched - 1.000 kohm. 
Information: Capacitance Unit from Milkyway design library: 'pf' 
Information: Design Library and main library capacitance units are matched - 1.000 pf. 
Warning: Inconsistent library data found for layer POLY1. (RCEX-018)

TLU+ File = ../lib/milkyway/tech/tluplus/smiclog018_6lm_cell_max.tluplus
TLU+ File = ../lib/milkyway/tech/tluplus/smiclog018_6lm_cell_min.tluplus

--------- Sanity Check on TLUPlus Files -------------
1. Checking the conducting layer names in ITF and mapping file ... 
[ Passed! ]
2. Checking the via layer names in ITF and mapping file ... 
[ Passed! ]
3. Checking the consistency of Min Width and Min Spacing between MW-tech and ITF ... 
[ Passed! ]
----------------- Check Ends ------------------
Information: The distance unit in Capacitance and Resistance is 1 micron. (RCEX-007)
Information: The RC model used is detail route TLU+. (RCEX-015)
Information: Start mixed mode parasitic extraction. (RCEX-023)
Information: Start rc extraction...
Memory usage for extraction task 275 Mbytes -- main task 457 Mbytes.
Information: Parasitic source is LPE. (RCEX-040)
Information: Parasitic mode is RealRC. (RCEX-041)
Information: Using virtual shield extraction. (RCEX-081)
Information: Extraction mode is MIN_MAX. (RCEX-042)
Information: Extraction derate is 125/125/125. (RCEX-043)
Information: Coupling capacitances are lumped to ground. (RCEX-044)
Information: Start back annotation for parasitic extraction. (RCEX-023)
Information: End back annotation for parasitic extraction. (RCEX-023)
Information: Start timing update for parasitic extraction. (RCEX-023)
Information: End timing update for parasitic extraction. (RCEX-023)
Information: End parasitic extraction. (RCEX-023)
1
icc_shell> write_sdf -version 2.1 /home/sasasatori/experiment/icc/outputs/cic_filter_post_layout.sdf
Information: Annotated 'cell' delays are assumed to include load delay. (UID-282)
Information: Writing timing information to file '/home/sasasatori/experiment/icc/outputs/cic_filter_post_layout.sdf'. (WT-3)
Information: Updating design information... (UID-85)
Information: Input delay ('rise') on clock port 'clk' will be added to the clock's propagated skew. (TIM-112)
Information: Input delay ('fall') on clock port 'clk' will be added to the clock's propagated skew. (TIM-112)
Information: Input delay ('rise') on clock port 'clk_div' will be added to the clock's propagated skew. (TIM-112)
Information: Input delay ('fall') on clock port 'clk_div' will be added to the clock's propagated skew. (TIM-112)
icc_shell> exit

Memory usage for main task 457 Mbytes.
Memory usage for this session 457 Mbytes.
CPU usage for this session 42 seconds ( 0.01 hours ).

Thank you...

